temp_users = {}  # временное хранилище User объектов, telegram_id -> User
current_editing = {}  # telegram_id -> текущий редактируемый счетчик
user_data = {}  # Временное хранилище данных пользователя во время регистрации
current_meters = {} # telegram_id -> словарь введенных показаний (название счетчика -> значение)

# Списки счетчиков
cold_water_meters = {
    1: ["ХВС"],
    2: ["ХВС-Кухня", "ХВС-Ванная"],
    3: ["ХВС-1", "ХВС-2", "ХВС-3"]
}

hot_water_meters = {
    1: ["ГВС"],
    2: ["ГВС-Кухня", "ГВС-Ванная"],
    3: ["ГВС-1", "ГВС-1", "ГВС-3"]
}

electricity_meters = {
    1: ["Электричество"],
    2: ["Электричество-День", "Электричество-Ночь"]
}

start_collection = [1, 19, 42]
notification_time = [1, 19, 43]  # Время напоминания. День, час, минута
end_collection = [1, 19, 44]

months = {
    1: 'январь', 2: 'февраль', 3: 'март', 4: 'апрель',
    5: 'май', 6: 'июнь', 7: 'июль', 8: 'август',
    9: 'сентябрь', 10: 'октябрь', 11: 'ноябрь', 12: 'декабрь'
}